CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_usbd_library/class/device/dfu/Source/dfu_core.c
/* USB interface string */
static usb_desc_str interface_string = {
    .header =
    {
        .bLength         = USB_STRING_LEN(15U),
        .bDescriptorType = USB_DESCTYPE_STR,
    },
    .unicode_string = {'@', 'I', 'n', 't', 'e', 'r', 'n', 'a', 'l', 'F', 'l', 'a', 's', 'h', ' ', '/', '0', 'x', '0', '8', '0', '0',
        '0', '0', '0', '0', '/', '1', '6', '*', '0', '0', '1', 'K', 'a', ',', '4', '8', '*', '0', '0', '1', 'K', 'g'
    }
};

uint8_t *usbd_dfu_strings[] = {
    [STR_IDX_LANGID]  = (uint8_t *) &usbd_language_id_desc,
    [STR_IDX_MFC]     = (uint8_t *) &manufacturer_string,
    [STR_IDX_PRODUCT] = (uint8_t *) &product_string,
    [STR_IDX_SERIAL]  = (uint8_t *) &serial_string,
    [STR_IDX_CONFIG]  = (uint8_t *) &config_string,
    [STR_IDX_ITF]     = (uint8_t *) &interface_string
};

usb_desc dfu_desc = {
    .dev_desc    = (uint8_t *) &dfu_dev_desc,
    .config_desc = (uint8_t *) &dfu_config_desc,
    .strings     = usbd_dfu_strings
};

usb_class dfu_class = {
    .init            = dfu_init,
    .deinit          = dfu_deinit,
    .req_process     = dfu_req_handler,
    .ctlx_in         = dfu_ctlx_in
};

/*!
    \brief      initialize the USB DFU device
    \param[in]  udev: pointer to USB device instance
    \param[in]  config_index: configuration index
    \param[out] none
    \retval     USB device operation status
*/
static uint8_t dfu_init(usb_dev *udev, uint8_t config_index)
{
    static usbd_dfu_handler dfu_handler;

    /* unlock the internal flash */
    fmc_unlock();

    systick_config();

    memset((void *)&dfu_handler, 0, sizeof(usbd_dfu_handler));

    dfu_handler.base_addr = APP_LOADED_ADDR;
    dfu_handler.manifest_state = MANIFEST_COMPLETE;
    dfu_handler.bState = STATE_DFU_IDLE;
    dfu_handler.bStatus = STATUS_OK;

    udev->class_data[USBD_DFU_INTERFACE] = (void *)&dfu_handler;

    return USBD_OK;
}

/*!
    \brief      de-initialize the USB DFU device
    \param[in]  udev: pointer to USB device instance
    \param[in]  config_index: configuration index
    \param[out] none
    \retval     USB device operation status
*/
static uint8_t dfu_deinit(usb_dev *udev, uint8_t config_index)
{
    usbd_dfu_handler *dfu = (usbd_dfu_handler *)udev->class_data[USBD_DFU_INTERFACE];

    /* restore device default state */
    memset(udev->class_data[USBD_DFU_INTERFACE], 0, sizeof(usbd_dfu_handler));

    dfu->bState = STATE_DFU_IDLE;
    dfu->bStatus = STATUS_OK;

    /* lock the internal flash */
    fmc_lock();

    return USBD_OK;
}

/*!
    \brief      handle the USB DFU class-specific requests
    \param[in]  udev: pointer to USB device instance
    \param[in]  req: device class-specific request
    \param[out] none
    \retval     USB device operation status
*/
static uint8_t dfu_req_handler(usb_dev *udev, usb_req *req)
{
    if(req->bRequest < DFU_REQ_MAX) {
        dfu_request_process[req->bRequest](udev, req);
    } else {
        return USBD_FAIL;
    }

    return USBD_OK;
}

/*!
    \brief      handle data stage
    \param[in]  udev: pointer to USB device instance
    \param[out] none
    \retval     USB device operation status
*/
static uint8_t dfu_ctlx_in(usb_dev *udev)
{
    dfu_getstatus_complete(udev);

    return USBD_OK;
}

/*!
    \brief      handle data in stage in control endpoint 0
    \param[in]  udev: pointer to USB device instance
    \param[out] none
    \retval     USB device operation status
  */
static uint8_t dfu_getstatus_complete(usb_dev *udev)
{
    uint32_t addr;
    uint32_t base1, base2, base3, base4;

    usbd_dfu_handler *dfu = (usbd_dfu_handler *)udev->class_data[USBD_DFU_INTERFACE];

    if(STATE_DFU_DNBUSY == dfu->bState) {
        /* decode the special command */
        if(0U == dfu->block_num) {
            if(1U == dfu->data_len) {
                if(GET_COMMANDS == dfu->buf[0]) {
                    /* no operation */
                }
            } else if(5U == dfu->data_len) {
                if(SET_ADDRESS_POINTER == dfu->buf[0]) {
                    /* set flash operation address */
                    base1 = *(uint8_t *)(dfu->buf + 1U);
                    base2 = *(uint8_t *)(dfu->buf + 2U) << 8U;
                    base3 = *(uint8_t *)(dfu->buf + 3U) << 16U;
                    base4 = *(uint8_t *)(dfu->buf + 4U) << 24U ;
                    dfu->base_addr = (base1 + (base2) + (base3) + (base4));
                    Pointer = dfu->base_addr;
                } else if(ERASE == dfu->buf[0]) {
                    base1 = *(uint8_t *)(dfu->buf + 1U);
                    base2 = *(uint8_t *)(dfu->buf + 2U) << 8U;
                    base3 = *(uint8_t *)(dfu->buf + 3U) << 16U;
                    base4 = *(uint8_t *)(dfu->buf + 4U) << 24U ;
                    dfu->base_addr = (base1 + (base2) + (base3) + (base4));

                    fmc_page_erase(dfu->base_addr);
                } else {
                    base1 = *(uint8_t *)(dfu->buf + 1U);
                    base2 = *(uint8_t *)(dfu->buf + 2U) << 8U;
                    base3 = *(uint8_t *)(dfu->buf + 3U) << 16U;
                    base4 = *(uint8_t *)(dfu->buf + 4U) << 24U ;
                    dfu->base_addr = (base1 + (base2) + (base3) + (base4));
                }
            } else {
                /* no operation */
            }
        } else if(dfu->block_num > 1U) {   /* regular download command */
            /* preform the write operation */
            uint32_t idx = 0U;

            /* decode the required address */
            addr = (dfu->block_num - 2U) * TRANSFER_SIZE + dfu->base_addr;
            if((addr & MAL_MASK_OB) == OB_RDPT) {
                udev->drv_handler->ep_write(udev->transc_in[0].xfer_buf, 0U, 0U);

                delay_1ms(100U);
                Option_Byte_Write(addr, dfu->buf);

                delay_1ms(100U);
                NVIC_SystemReset();
            } else {
                if(dfu->data_len & 0x03U) {  /* not an aligned data */
                    for(idx = dfu->data_len; idx < ((dfu->data_len & 0xFFFCU) + 4U); idx++) {
                        dfu->buf[idx] = 0xFFU;
                    }
                }

                /* data received are word multiple */
                for(idx = 0U; idx < dfu->data_len; idx += 4U) {
                    fmc_word_program(addr, *(uint32_t *)(dfu->buf + idx));

                    addr += 4U;
                }

