CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_usbd_library/class/device/dfu/Source/dfu_core.c
                dfu->block_num = 0U;
            }
        } else {
            /* no operation */
        }

        dfu->data_len = 0U;

        /* update the device state and poll timeout */
        dfu->bState = STATE_DFU_DNLOAD_SYNC;

        return USBD_OK;
    } else if(STATE_DFU_MANIFEST == dfu->bState) {   /* manifestation in progress */
        /* start leaving DFU mode */
        dfu_mode_leave(udev);
    } else {
        /* no operation */
    }

    return USBD_OK;
}

/*!
    \brief      handle the DFU_DETACH request
    \param[in]  udev: pointer to USB device instance
    \param[in]  req: DFU class request
    \param[out] none
    \retval     none.
*/
static void dfu_detach(usb_dev *udev, usb_req *req)
{
    usbd_dfu_handler *dfu = (usbd_dfu_handler *)udev->class_data[USBD_DFU_INTERFACE];

    switch(dfu->bState) {
    case STATE_DFU_IDLE:
    case STATE_DFU_DNLOAD_SYNC:
    case STATE_DFU_DNLOAD_IDLE:
    case STATE_DFU_MANIFEST_SYNC:
    case STATE_DFU_UPLOAD_IDLE:
        dfu->bStatus = STATUS_OK;
        dfu->bState = STATE_DFU_IDLE;
        dfu->iString = 0U; /* iString */

        dfu->block_num = 0U;
        dfu->data_len = 0U;
        break;

    default:
        break;
    }

    /* check the detach capability in the DFU functional descriptor */
    if(dfu_config_desc.dfu_func.wDetachTimeOut & DFU_DETACH_MASK) {
        usbd_disconnect(udev);

        usbd_connect(udev);
    } else {
        /* wait for the period of time specified in detach request */
        delay_1ms(100U);
    }
}

/*!
    \brief      handle the DFU_DNLOAD request
    \param[in]  udev: pointer to USB device instance
    \param[in]  req: DFU class request
    \param[out] none
    \retval     none
*/
static void dfu_dnload(usb_dev *udev, usb_req *req)
{
    usb_transc *transc = &udev->transc_out[0];

    usbd_dfu_handler *dfu = (usbd_dfu_handler *)udev->class_data[USBD_DFU_INTERFACE];

    switch(dfu->bState) {
    case STATE_DFU_IDLE:
    case STATE_DFU_DNLOAD_IDLE:
        if(req->wLength > 0U) {
            /* update the global length and block number */
            dfu->block_num = req->wValue;
            dfu->data_len = req->wLength;

            dfu->bState = STATE_DFU_DNLOAD_SYNC;

            transc->xfer_len = dfu->data_len;
            transc->xfer_buf = dfu->buf;
            transc->xfer_count = 0U;
        } else {
            dfu->manifest_state = MANIFEST_IN_PROGRESS;
            dfu->bState = STATE_DFU_MANIFEST_SYNC;
        }
        break;

    default:
        break;
    }
}

/*!
    \brief      handles the DFU UPLOAD request.
    \param[in]  udev: pointer to USB device instance
    \param[in]  req: DFU class request
    \param[out] none
    \retval     none
*/
static void dfu_upload(usb_dev *udev, usb_req *req)
{
    uint8_t *phy_addr = NULL;
    uint32_t addr = 0U;
    uint32_t base1, base2, base3, base4;

    usbd_dfu_handler *dfu = (usbd_dfu_handler *)udev->class_data[USBD_DFU_INTERFACE];

    if(req->wLength <= 0U) {
        dfu->bState = STATE_DFU_IDLE;

        return;
    }

    usb_transc *transc = &udev->transc_in[0];

    switch(dfu->bState) {
    case STATE_DFU_IDLE:
    case STATE_DFU_UPLOAD_IDLE:
        /* update the global length and block number */
        dfu->block_num = req->wValue;
        dfu->data_len = req->wLength;

        /* DFU get command */
        if(0U == dfu->block_num) {
            /* update the state machine */
            dfu->bState = (dfu->data_len > 3U) ? STATE_DFU_IDLE : STATE_DFU_UPLOAD_IDLE;

            /* store the values of all supported commands */
            dfu->buf[0] = GET_COMMANDS;
            dfu->buf[1] = SET_ADDRESS_POINTER;
            dfu->buf[2] = ERASE;

            /* send the status data over EP0 */
            transc->xfer_buf = &(dfu->buf[0]);
            transc->xfer_len = 3U;
        } else if(dfu->block_num > 1U) {
            dfu->bState = STATE_DFU_UPLOAD_IDLE;

            base1 = *(uint8_t *)(dfu->buf + 1U);
            base2 = *(uint8_t *)(dfu->buf + 2U) << 8U;
            base3 = *(uint8_t *)(dfu->buf + 3U) << 16U;
            base4 = *(uint8_t *)(dfu->buf + 4U) << 24U ;
            dfu->base_addr = (base1 + (base2) + (base3) + (base4));
            /* change is accelerated */
            addr = (dfu->block_num - 2U) * TRANSFER_SIZE + dfu->base_addr;

            if(OB_RDPT != addr) {
                if((FMC_OBSTAT & 0x2) != 0x0) {
                    return;
                }
            }
            /* return the physical address where data are stored */
            phy_addr = (uint8_t *)(addr);

            /* send the status data over EP0 */
            transc->xfer_buf = phy_addr;
            transc->xfer_len = dfu->data_len;
        } else {
            dfu->bState = STATUS_ERR_STALLEDPKT;
        }
        break;

    default:
        dfu->data_len = 0U;
        dfu->block_num = 0U;
        break;
    }
}

/*!
    \brief      handle the DFU_GETSTATUS request
    \param[in]  udev: pointer to USB device instance
    \param[in]  req: DFU class request
    \param[out] none
    \retval     none
*/
static void dfu_getstatus(usb_dev *udev, usb_req *req)
{
    usb_transc *transc = &udev->transc_in[0];

    usbd_dfu_handler *dfu = (usbd_dfu_handler *)udev->class_data[USBD_DFU_INTERFACE];

    switch(dfu->bState) {
    case STATE_DFU_DNLOAD_SYNC:
        if(0U != dfu->data_len) {
            dfu->bState = STATE_DFU_DNBUSY;

            if(0U == dfu->block_num) {
                if(ERASE == dfu->buf[0]) {
                    SET_POLLING_TIMEOUT(FLASH_ERASE_TIMEOUT);
                } else {
                    SET_POLLING_TIMEOUT(FLASH_WRITE_TIMEOUT);
                }
            }
        } else {
            dfu->bState = STATE_DFU_DNLOAD_IDLE;
        }
        break;

    case STATE_DFU_MANIFEST_SYNC:
        if(MANIFEST_IN_PROGRESS == dfu->manifest_state) {
            dfu->bState = STATE_DFU_MANIFEST;
            dfu->bwPollTimeout0 = 1U;
        } else if((MANIFEST_COMPLETE == dfu->manifest_state) && \
                  (dfu_config_desc.dfu_func.bmAttributes & 0x04U)) {
            dfu->bState = STATE_DFU_IDLE;
            dfu->bwPollTimeout0 = 0U;
        } else {
            /* no operation */
        }
        break;

    default:
        break;
    }

